---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.DistributionSysTypeSetIterator
source: html/656e412e-2d23-f0ee-b545-8bebf91c8d2f.htm
---
# DistributionSysTypeSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.